https://pandas.pydata.org

Definizione sul sito

pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.

In [1]:
#importa il modulo pandas
import pandas as pd

In [2]:
#creazione di un DataFrame fittizio
dati = pd.DataFrame({'Nome': ['Pluto', 'Paperino', 'Minny', 'Gastone', 'Gnomo', 'Elfo', 'Nano', 'Fata', 'Pippo'],
                   'Peso':[50, 67, 55, 63, 20, 180, 130, 80, 60],
                   'Altezza':[35, 25, 22, 24, 15, 80, 65, 35, 140],
                   'Fantasia': ['media', 'altissima', 'alta', 'bassa', 'media', 'alta', 'media', 'altissima', 'altissima'],
                   'Sesso': ['m','m','f','m','m','m','m', 'f', 'm'], 
                   'Liv. Informatica': ['1', '2', '4', '3', '1', '5', '3', '5', '1']})

In [3]:
print(dati)

       Nome  Peso  Altezza   Fantasia Sesso Liv. Informatica
0     Pluto    50       35      media     m                1
1  Paperino    67       25  altissima     m                2
2     Minny    55       22       alta     f                4
3   Gastone    63       24      bassa     m                3
4     Gnomo    20       15      media     m                1
5      Elfo   180       80       alta     m                5
6      Nano   130       65      media     m                3
7      Fata    80       35  altissima     f                5
8     Pippo    60      140  altissima     m                1

In [4]:
#esporta dati su file .csv
dati.to_csv('Test_ITPASS_0809.csv') #esporta su file .csv

In [5]:
#esporta dati su file .xlsx
dati.to_excel('Test_ITPASS_0809.xlsx') #esporta su file .xlsx

In [6]:
#importazione da sito remoto archive.ics.uci.edu (Machine Learning Repository)
dati_wine = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data")

In [7]:
print(dati_wine)

     1  14.23  1.71  2.43  15.6  127   2.8  3.06   .28  2.29   5.64  1.04  \
0    1  13.20  1.78  2.14  11.2  100  2.65  2.76  0.26  1.28   4.38  1.05
1    1  13.16  2.36  2.67  18.6  101  2.80  3.24  0.30  2.81   5.68  1.03
2    1  14.37  1.95  2.50  16.8  113  3.85  3.49  0.24  2.18   7.80  0.86
3    1  13.24  2.59  2.87  21.0  118  2.80  2.69  0.39  1.82   4.32  1.04
4    1  14.20  1.76  2.45  15.2  112  3.27  3.39  0.34  1.97   6.75  1.05
..  ..    ...   ...   ...   ...  ...   ...   ...   ...   ...    ...   ...
172  3  13.71  5.65  2.45  20.5   95  1.68  0.61  0.52  1.06   7.70  0.64
173  3  13.40  3.91  2.48  23.0  102  1.80  0.75  0.43  1.41   7.30  0.70
174  3  13.27  4.28  2.26  20.0  120  1.59  0.69  0.43  1.35  10.20  0.59
175  3  13.17  2.59  2.37  20.0  120  1.65  0.68  0.53  1.46   9.30  0.60
176  3  14.13  4.10  2.74  24.5   96  2.05  0.76  0.56  1.35   9.20  0.61

     3.92  1065
0    3.40  1050
1    3.17  1185
2    3.45  1480
3    2.93   735
4    2.85  1450
..    ...   ...
172  1.74   740
173  1.56   750
174  1.56   835
175  1.62   840
176  1.60   560

[177 rows x 14 columns]

In [8]:
#scrivere dataset in pi√π fogli di un documento excel
with pd.ExcelWriter('Test_ITPASS_0809_multiplo.xlsx') as writer:
    dati.to_excel(writer, sheet_name='esempio_1')
    dati_wine.to_excel(writer, sheet_name='esempio_2', index=False)

In [9]:
print(dati)

       Nome  Peso  Altezza   Fantasia Sesso Liv. Informatica
0     Pluto    50       35      media     m                1
1  Paperino    67       25  altissima     m                2
2     Minny    55       22       alta     f                4
3   Gastone    63       24      bassa     m                3
4     Gnomo    20       15      media     m                1
5      Elfo   180       80       alta     m                5
6      Nano   130       65      media     m                3
7      Fata    80       35  altissima     f                5
8     Pippo    60      140  altissima     m                1

In [10]:
#statistiche descrittive
dati.describe()

             Peso     Altezza
count    9.000000    9.000000
mean    78.333333   49.000000
std     48.033842   40.274061
min     20.000000   15.000000
25%     55.000000   24.000000
50%     63.000000   35.000000
75%     80.000000   65.000000
max    180.000000  140.000000

In [ ]:
#tipo di dati per ogni variabile del dataset
dati.dtypes

In [11]:
#esempio tipo di ordinamento
dati.sort_values(by = 'Fantasia')

       Nome  Peso  Altezza   Fantasia Sesso Liv. Informatica
2     Minny    55       22       alta     f                4
5      Elfo   180       80       alta     m                5
1  Paperino    67       25  altissima     m                2
7      Fata    80       35  altissima     f                5
8     Pippo    60      140  altissima     m                1
3   Gastone    63       24      bassa     m                3
0     Pluto    50       35      media     m                1
4     Gnomo    20       15      media     m                1
6      Nano   130       65      media     m                3

In [14]:
print(dati)

       Nome  Peso  Altezza   Fantasia Sesso Liv. Informatica
0     Pluto    50       35      media     m                1
1  Paperino    67       25  altissima     m                2
2     Minny    55       22       alta     f                4
3   Gastone    63       24      bassa     m                3
4     Gnomo    20       15      media     m                1
5      Elfo   180       80       alta     m                5
6      Nano   130       65      media     m                3
7      Fata    80       35  altissima     f                5
8     Pippo    60      140  altissima     m                1

In [ ]:
#estrae il 5 caso e seconda variabile
dati.iloc[5, 2]

In [12]:
#estrae dal 5 caso la seconda variabile
dati_estr = dati.iloc[5:, 2]

In [13]:
print(dati_estr)

5     80
6     65
7     35
8    140
Name: Altezza, dtype: int64

In [15]:
#test su condizioni
dati[dati['Peso'] > 100]

   Nome  Peso  Altezza Fantasia Sesso Liv. Informatica
5  Elfo   180       80     alta     m                5
6  Nano   130       65    media     m                3

In [ ]:
#esempio di ordinamento per peso discendente del DataFrame ed estrazione del primo caso
dati.sort_values(by = 'Peso', ascending = False).iloc[0:1, :]

In [16]:
#crea nuova colonna nel DataFrame
dati['Peso in grammi'] = dati['Peso'] * 1000

In [17]:
print(dati)

       Nome  Peso  Altezza   Fantasia Sesso Liv. Informatica  Peso in grammi
0     Pluto    50       35      media     m                1           50000
1  Paperino    67       25  altissima     m                2           67000
2     Minny    55       22       alta     f                4           55000
3   Gastone    63       24      bassa     m                3           63000
4     Gnomo    20       15      media     m                1           20000
5      Elfo   180       80       alta     m                5          180000
6      Nano   130       65      media     m                3          130000
7      Fata    80       35  altissima     f                5           80000
8     Pippo    60      140  altissima     m                1           60000

In [18]:
#cancella una colonna dal DataFrame
del dati['Peso in grammi']

In [19]:
print(dati)

       Nome  Peso  Altezza   Fantasia Sesso Liv. Informatica
0     Pluto    50       35      media     m                1
1  Paperino    67       25  altissima     m                2
2     Minny    55       22       alta     f                4
3   Gastone    63       24      bassa     m                3
4     Gnomo    20       15      media     m                1
5      Elfo   180       80       alta     m                5
6      Nano   130       65      media     m                3
7      Fata    80       35  altissima     f                5
8     Pippo    60      140  altissima     m                1

In [20]:
#creazione DataFrame con un caso duplicato
dati = pd.DataFrame({'Nome': ['Pluto', 'Paperino', 'Minny', 'Gastone', 'Gnomo', 'Elfo', 'Nano', 'Fata', 'Nano'],
                   'Peso':[50, 67, 55, 63, 20, 180, 130, 80, 130],
                   'Altezza':[35, 25, 22, 24, 15, 80, 65, 35, 65],
                   'Fantasia': ['media', 'altissima', 'alta', 'bassa', 'media', 'alta', 'media', 'altissima', 'media'],
                   'Sesso': ['m','m','f','m','m','m','m', 'f', 'm'], 
                   'Liv. Informatica': ['1', '2', '4', '3', '1', '5', '3', '5', '3']})

In [ ]:
#esempio inversioni di casi e variabili
dati.T

In [21]:
#verifica casi duplicati del DataFrame
dati.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
dtype: bool

In [22]:
#creazione nuovo DataFrame senza duplicati
dati_nuovi = dati.drop_duplicates()

In [23]:
#verifica casi duplicati
dati_nuovi.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
dtype: bool

In [ ]:
print(dati_nuovi)

In [24]:
#visualizzazione dei dati con rapprensentazione variabile e valore
pd.melt(dati)

            variable      value
0               Nome      Pluto
1               Nome   Paperino
2               Nome      Minny
3               Nome    Gastone
4               Nome      Gnomo
5               Nome       Elfo
6               Nome       Nano
7               Nome       Fata
8               Nome       Nano
9               Peso         50
10              Peso         67
11              Peso         55
12              Peso         63
13              Peso         20
14              Peso        180
15              Peso        130
16              Peso         80
17              Peso        130
18           Altezza         35
19           Altezza         25
20           Altezza         22
21           Altezza         24
22           Altezza         15
23           Altezza         80
24           Altezza         65
25           Altezza         35
26           Altezza         65
27          Fantasia      media
28          Fantasia  altissima
29          Fantasia       alta
30          Fantasia      bassa
31          Fantasia      media
32          Fantasia       alta
33          Fantasia      media
34          Fantasia  altissima
35          Fantasia      media
36             Sesso          m
37             Sesso          m
38             Sesso          f
39             Sesso          m
40             Sesso          m
41             Sesso          m
42             Sesso          m
43             Sesso          f
44             Sesso          m
45  Liv. Informatica          1
46  Liv. Informatica          2
47  Liv. Informatica          4
48  Liv. Informatica          3
49  Liv. Informatica          1
50  Liv. Informatica          5
51  Liv. Informatica          3
52  Liv. Informatica          5
53  Liv. Informatica          3